docs/Win32_ComputerSystem.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration">
    <env:Header />
    <env:Body>
        <n:PullReponse>
            <n:Items>
                <p:Win32_ComputerSystem xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wmi/root/cimv2/Win32_ComputerSystem" xmlns:cim="http://schemas.dmtf.org/wbem/wscim/1/common" xsi:type="p:Win32_ComputerSystem_Type">
                    <p:AdminPasswordStatus>3</p:AdminPasswordStatus>
                    <p:AutomaticManagedPagefile>true</p:AutomaticManagedPagefile>
                    <p:AutomaticResetBootOption>true</p:AutomaticResetBootOption>
                    <p:AutomaticResetCapability>true</p:AutomaticResetCapability>
                    <p:BootOptionOnLimit xsi:nil="true" />
                    <p:BootOptionOnWatchDog xsi:nil="true" />
                    <p:BootROMSupported>true</p:BootROMSupported>
                    <p:BootStatus>0</p:BootStatus>
                    <p:BootStatus>0</p:BootStatus>
                    <p:BootStatus>0</p:BootStatus>
                    <p:BootStatus>127</p:BootStatus>
                    <p:BootStatus>4</p:BootStatus>
                    <p:BootStatus>0</p:BootStatus>
                    <p:BootStatus>127</p:BootStatus>
                    <p:BootStatus>0</p:BootStatus>
                    <p:BootStatus>0</p:BootStatus>
                    <p:BootStatus>0</p:BootStatus>
                    <p:BootupState>Normal boot</p:BootupState>
                    <p:Caption>SMNNOVCTXVDA1</p:Caption>
                    <p:ChassisBootupState>3</p:ChassisBootupState>
                    <p:ChassisSKUNumber xsi:nil="true" />
                    <p:CreationClassName>Win32_ComputerSystem</p:CreationClassName>
                    <p:CurrentTimeZone>-300</p:CurrentTimeZone>
                    <p:DaylightInEffect>false</p:DaylightInEffect>
                    <p:Description>AT/AT COMPATIBLE</p:Description>
                    <p:DNSHostName>smnnovctxvda1</p:DNSHostName>
                    <p:Domain>samana.local</p:Domain>
                    <p:DomainRole>3</p:DomainRole>
                    <p:EnableDaylightSavingsTime>true</p:EnableDaylightSavingsTime>
                    <p:FrontPanelResetStatus>3</p:FrontPanelResetStatus>
                    <p:HypervisorPresent>true</p:HypervisorPresent>
                    <p:InfraredSupported>false</p:InfraredSupported>
                    <p:InstallDate xsi:nil="true" />
                    <p:KeyboardPasswordStatus>3</p:KeyboardPasswordStatus>
                    <p:LastLoadInfo xsi:nil="true" />
                    <p:Manufacturer>OpenStack Foundation</p:Manufacturer>
                    <p:Model>OpenStack Nova</p:Model>
                    <p:Name>SMNNOVCTXVDA1</p:Name>
                    <p:NameFormat xsi:nil="true" />
                    <p:NetworkServerModeEnabled>true</p:NetworkServerModeEnabled>
                    <p:NumberOfLogicalProcessors>4</p:NumberOfLogicalProcessors>
                    <p:NumberOfProcessors>4</p:NumberOfProcessors>
                    <p:PartOfDomain>true</p:PartOfDomain>
                    <p:PauseAfterReset>-1</p:PauseAfterReset>
                    <p:PCSystemType>1</p:PCSystemType>
                    <p:PCSystemTypeEx>1</p:PCSystemTypeEx>
                    <p:PowerManagementSupported xsi:nil="true" />
                    <p:PowerOnPasswordStatus>3</p:PowerOnPasswordStatus>
                    <p:PowerState>0</p:PowerState>
                    <p:PowerSupplyState>3</p:PowerSupplyState>
                    <p:PrimaryOwnerContact xsi:nil="true" />
                    <p:PrimaryOwnerName>Windows User</p:PrimaryOwnerName>
                    <p:ResetCapability>1</p:ResetCapability>
                    <p:ResetCount>-1</p:ResetCount>
                    <p:ResetLimit>-1</p:ResetLimit>
                    <p:Roles>LM_Workstation</p:Roles>
                    <p:Roles>LM_Server</p:Roles>
                    <p:Roles>NT</p:Roles>
                    <p:Roles>Server_NT</p:Roles>
                    <p:Status>OK</p:Status>
                    <p:SystemFamily>Virtual Machine</p:SystemFamily>
                    <p:SystemSKUNumber xsi:nil="true" />
                    <p:SystemStartupDelay xsi:nil="true" />
                    <p:SystemStartupSetting xsi:nil="true" />
                    <p:SystemType>x64-based PC</p:SystemType>
                    <p:ThermalState>3</p:ThermalState>
                    <p:TotalPhysicalMemory>8589377536</p:TotalPhysicalMemory>
                    <p:UserName xsi:nil="true" />
                    <p:WakeUpType>6</p:WakeUpType>
                    <p:Workgroup xsi:nil="true" />
                </p:Win32_ComputerSystem>
            </n:Items>
        </n:PullReponse>
    </env:Body>
</env:Envelope>